import del from "../assets/del.jpg";
import ekhraji from "../assets/ekhraji.jpg";
import hotel from "../assets/hotel.jpg";
import mah from "../assets/mah.jpg";
import money from "../assets/money.jpg";
import shahrzad from "../assets/shahrzad.jpg";
import Movie from "./Movie.jsx";
export default function Movies() {
  const movies = [
    {
      name: "شهرزاد",
      imgUrl: shahrzad,
      episode: 32,
      details:
        "داستان سریال شهرزاد در دههٔ ۱۳۳۰ خورشیدی می‌گذرد و روایتی عاشقانه بر بستر تاریخ است. نغمه ثمینی و حسن فتحی نویسندگان این مجموعه‌اند. سریال شهرزاد به کارگردانی حسن فتحی و بازی علی نصیریان، ترانه علیدوستی، مصطفی زمانی،شهاب حسینی و پریناز ایزدیار یک سریال درام تاریخی و عاشقانه است که برای پخش خانگی تولید شده‌است",
    },
    {
      name: "اخراجی ها",
      imgUrl: ekhraji,
      episode: 20,
      details:
        "اخراجی‌ها به نویسندگی و کارگردانی مسعود ده‌نمکی، سه‌گانه فیلمی که است که اولین قسمت آن در سال ۱۳۸۶ اکران شد و فروشی بیش از ۲ میلیارد تومان داشت. در سال ۱۳۸۷ قسمت دوم اخراجی‌ها با فروش ۸٬۵۰۰٬۰۰۰٬۰۰۰ تومان پرفروشترین فیلم تاریخ سینمای ایران لقب گرفت.",
    },
    {
      name: "دل",
      imgUrl: del,
      episode: 28,
      details:
        "سریال دل یک ملودرام عاشقانه و اجتماعی است که در شبکه نمایش خانگی پخش شده است. داستان اصلی سریال درباره دو عاشق به نام‌های آرش و رستا است که پس از فراز و نشیب‌های فراوان به روز عروسی خود می‌رسند. اما در شب عروسی، اتفاقاتی رخ می‌دهد که زندگی آن‌ها و خانواده‌هایشان را برای همیشه تغییر می‌دهد.",
    },
    {
      name: "سرقت پول",
      imgUrl: money,
      episode: 34,
      details:
        "سرقت پول (Money Heist یا La casa de papel) یک سریال تلویزیونی اسپانیایی است که داستان یک گروه سارق را روایت می‌کند که به رهبری مردی مرموز به نام پروفسور دست به سرقت از ضرابخانه سلطنتی اسپانیا می‌زنند. هدف آن‌ها چاپ ۲.۴ میلیارد یورو پول و فرار از مهلکه است. این سریال به پیچیدگی‌های نقشه سرقت، چالش‌ها و موانع پیش‌رو و همچنین روابط بین اعضای گروه می‌پردازد",
    },
    {
      name: "ماه تابو",
      imgUrl: mah,
      episode: 12,
      details: "lorem ipesum.............",
    },
    {
      name: "هوتل",
      imgUrl: hotel,
      episode: 1,
      details:
        "هتل فیلم کمدی اسکروبال ایرانی محصول سال ۱۴۰۲ به کارگردانی مسعود اطیابی و تهیه‌کنندگی محمد شایسته است. هتل با بازی پژمان جمشیدی و محسن کیایی داستان دو زوج را روایت می‌کند که در سفر به کیش دچار چالش‌های کمدی می‌شوند. اکران فیلم از ۵ مهر تا ۲۹ اسفند ۱۴۰۲ در سینماهای ایران انجام شد",
    },
  ];

  return (
    <div className="h-screen w-full flex space-y-2 flex-wrap justify-between p-2">
      {movies.map((movie) => (
        <Movie
          name={movie.name}
          imgUrl={movie.imgUrl}
          ep={movie.episode}
          details={movie.details}
        />
      ))}
    </div>
  );
}
